In [1]:
import pandas as pd
import numpy as np

In [2]:
# Pandas对象使用Numpy通用函数

rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [3]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [4]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [5]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [8]:
# 通用函数 索引对齐

area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [9]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [10]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [12]:
A.add(B, fill_value=100)

0    102.0
1      5.0
2      9.0
3    105.0
dtype: float64

In [17]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('BA'))
A

    B   A
0  17   3
1  13  17

In [19]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('CAB'))
B

   C  A  B
0  9  8  9
1  4  1  3
2  6  7  2

In [20]:
A + B # 两个对象的行列索引可以是不同顺序的，结果的索引会自动按顺序排列

      A     B   C
0  11.0  26.0 NaN
1  18.0  16.0 NaN
2   NaN   NaN NaN

In [21]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0  11.0  26.0  21.5
1  18.0  16.0  16.5
2  19.5  14.5  18.5

In [22]:
A = rng.randint(10, size=(3, 4))
A

array([[0, 3, 1, 7],
       [3, 1, 5, 5],
       [9, 3, 5, 1]])

In [23]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 3, -2,  4, -2],
       [ 9,  0,  4, -6]])

In [24]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  3 -2  4 -2
2  9  0  4 -6

In [25]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -3  0 -2  4
1  2  0  4  4
2  6  0  2 -2

In [26]:
halfrow = df.iloc[0, ::2]
halfrow

Q    0
S    1
Name: 0, dtype: int64

In [27]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  3.0 NaN  4.0 NaN
2  9.0 NaN  4.0 NaN